app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    function tryLogin() {
        $adminModel = new \App\Models\AdminModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $adminModel->where('username', $username)->first();