app/Controllers/Barang.php

    public function index()
    {
        return view('layout/up', ['title' => 'Barang'])
            .view('dashboard/barang', [
                'barangs' => $this->barangModel->select('*, barang.id_barang')->join('detail_barang', 'detail_barang.id_barang = barang.id_barang', 'left')->get()
                ])
---
SELECT *, `barang`.`id_barang`
FROM `barang`
LEFT JOIN `detail_barang` ON `detail_barang`.`id_barang` = `barang`.`id_barang`