app/Controllers/Laporan.php

SELECT *
FROM `transaksi`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
JOIN `barang` ON `transaksi`.`id_barang` = `barang`.`id_barang`
---
    public function index()
    {
        return view('layout/up', ['title' => 'Barang'])
            .view('dashboard/laporan', [
                'transaksis' => $this->transaksiModel
                    ->select('*')
                    ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
                    ->join('barang', 'transaksi.id_barang = barang.id_barang')
                    ->get()
                ])